{
  "annotator.nvim": {
    "branch": "main"
  },
  "baleia.nvim": {
    "branch": "main"
  },
  "better-escape.nvim": {
    "branch": "master"
  },
  "blink-ripgrep.nvim": {
    "branch": "main"
  },
  "blink.cmp": {
    "branch": "main"
  },
  "blink.pairs": {
    "branch": "main"
  },
  "codediff.nvim": {
    "branch": "main"
  },
  "colorful-menu.nvim": {
    "branch": "master"
  },
  "conform.nvim": {
    "branch": "master"
  },
  "diffs.nvim": {
    "branch": "main"
  },
  "dropbar.nvim": {
    "branch": "master"
  },
  "fff.nvim": {
    "branch": "main"
  },
  "firenvim": {
    "branch": "master"
  },
  "flash.nvim": {
    "branch": "main"
  },
  "gitlinker.nvim": {
    "branch": "master"
  },
  "gitsigns.nvim": {
    "branch": "main"
  },
  "grug-far.nvim": {
    "branch": "main"
  },
  "guh.nvim": {
    "branch": "main"
  },
  "hererocks": {
    "branch": "master"
  },
  "hunk.nvim": {
    "branch": "master"
  },
  "iex.nvim": {
    "branch": "master"
  },
  "inc-rename.nvim": {
    "branch": "main"
  },
  "jiejie.nvim": {
    "branch": "main"
  },
  "jj.nvim": {
    "branch": "main"
  },
  "lazy.nvim": {
    "branch": "main"
  },
  "lazydev.nvim": {
    "branch": "main"
  },
  "log-highlight.nvim": {
    "branch": "main"
  },
  "lush.nvim": {
    "branch": "main"
  },
  "markdown.nvim": {
    "branch": "master"
  },
  "mdn.nvim": {
    "branch": "main"
  },
  "mini.ai": {
    "branch": "main"
  },
  "mini.clue": {
    "branch": "main"
  },
  "mini.diff": {
    "branch": "main"
  },
  "mini.fuzzy": {
    "branch": "main"
  },
  "mini.icons": {
    "branch": "main"
  },
  "mini.jump": {
    "branch": "main"
  },
  "mini.jump2d": {
    "branch": "main"
  },
  "mini.pairs": {
    "branch": "main"
  },
  "mini.surround": {
    "branch": "main"
  },
  "msgarea.nvim": {
    "branch": "main"
  },
  "neogit": {
    "branch": "master"
  },
  "noice.nvim": {
    "branch": "main"
  },
  "nui.nvim": {
    "branch": "main"
  },
  "numb.nvim": {
    "branch": "master"
  },
  "nvim-autopairs": {
    "branch": "master"
  },
  "nvim-dap": {
    "branch": "master"
  },
  "nvim-dap-ui": {
    "branch": "master"
  },
  "nvim-dap-virtual-text": {
    "branch": "master"
  },
  "nvim-genghis": {
    "branch": "main"
  },
  "nvim-nio": {
    "branch": "master"
  },
  "nvim-tree-pairs": {
    "branch": "main"
  },
  "nvim-treesitter": {
    "branch": "main"
  },
  "nvim-treesitter-context": {
    "branch": "master"
  },
  "nvim-treesitter-textobjects": {
    "branch": "main"
  },
  "nvim-ts-autotag": {
    "branch": "main"
  },
  "nvim-web-devicons": {
    "branch": "master"
  },
  "obsidian.nvim": {
    "branch": "main"
  },
  "oil.nvim": {
    "branch": "master"
  },
  "one-small-step-for-vimkind": {
    "branch": "main"
  },
  "output-panel.nvim": {
    "branch": "main"
  },
  "plenary.nvim": {
    "branch": "master"
  },
  "prompt-yank.nvim": {
    "branch": "main"
  },
  "rainbow-delimiters.nvim": {
    "branch": "master"
  },
  "refer.nvim": {
    "branch": "main"
  },
  "render-markdown.nvim": {
    "branch": "main"
  },
  "schemastore.nvim": {
    "branch": "main"
  },
  "smart-splits.nvim": {
    "branch": "master"
  },
  "snacks.nvim": {
    "branch": "main"
  },
  "tiny-code-action.nvim": {
    "branch": "main"
  },
  "tiny-inline-diagnostic.nvim": {
    "branch": "main"
  },
  "treesitter-endwise.nvim": {
    "branch": "master"
  },
  "treesitter-unit": {
    "branch": "main"
  },
  "treesj": {
    "branch": "main"
  },
  "trouble.nvim": {
    "branch": "main"
  },
  "tssorter.nvim": {
    "branch": "main"
  },
  "unclash.nvim": {
    "branch": "main"
  },
  "vim-matchup": {
    "branch": "master"
  },
  "vim-projectionist": {
    "branch": "master"
  },
  "vim-test": {
    "branch": "master"
  },
  "virt-column.nvim": {
    "branch": "master"
  },
  "which-key.nvim": {
    "branch": "main"
  }
}
