#!/bin/sh

cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dev-tools'
tap 'homebrew/services'
# tap 'kopischke/ctags'
tap 'neovim/neovim'
tap 'caius/jo'
tap 'simeji/jid'
tap 'wix/brew'
tap 'homebrew/cask-drivers'

# -- for qmk_pok3r programming
#tap 'osx-cross/avr'
#tap 'PX4/homebrew-px4'
#brew 'avr-gcc@7'
#brew 'dfu-programmer'
#brew 'gcc-arm-none-eabi'
#brew 'avrdude'

brew 'ansifilter'
brew 'autoconf'
brew 'automake'
brew 'aspell', args: ['--with-lang-en']
# brew 'asdf'
brew 'bat'
brew 'cmake'
brew 'coreutils'
brew 'curl'
# brew 'universal-ctags/universal-ctags/universal-ctags', args: ['--HEAD']
brew 'dbus'
brew 'diff-so-fancy'
brew 'docker'
brew 'docker-compose'
brew 'docker-machine' #, restart_service: true, link: false
brew 'docker-completion'
brew 'doxygen', args: ['--with-qt', '--with-graphviz', '--with-llvm']
# brew 'elixir' # installed via asdf
brew 'extract_url'
brew 'exercism'
brew 'fasd'
brew 'fd'
brew 'ffind'
brew 'figlet'
brew 'findutils'
brew 'fontforge'
brew 'fzf'
brew 'fzy'
brew 'gawk'
brew 'gettext'
brew 'gist'
brew 'git'
brew 'git-extras'
brew 'git-flow'
brew 'global', args: ['with-ctags', 'with-pygments']
brew 'gnutls'
brew 'gnupg'
brew 'gnu-sed', args: ['with-default-names']
brew 'gpg' # required for asdf-nodejs
brew 'grc'
brew 'grv'
brew 'hub'
brew 'highlight'
brew 'httpie'
brew 'htop'
brew 'imagemagick'
brew 'jid'
brew 'jo'
brew 'jq'
brew 'libgcrypt'
brew 'libtool'
brew 'libyaml'
brew 'libxslt'
brew 'lnav'
# brew 'lua' # installed via asdf
brew 'luarocks'
# brew 'm-cli'
# brew 'mac-cli'
brew 'mas'
brew 'moreutils'
brew 'mysql'
brew 'mycli'
# brew 'mysql@5.6'
brew 'ncdu'
brew 'ncurses'
brew 'neovim', args: ['with-lua', 'with-perl', 'with-ruby']
brew 'nmap'
brew 'nnn'
brew 'noti'
brew 'openssl'
brew 'p7zip'
brew 'perl'
brew 'pgcli'
brew 'pkg-config'
brew 'postgresql@9.5'
brew 'postgis'
brew 'python'
brew 'python3'
brew 'python@2'
# brew 'rabbitmq' # requires erlang/rebar/rebar3
brew 'readline'
# brew 'reattach-to-user-namespace', args: ['wrap-pbcopy-and-pbpaste']
brew 'ren'
brew 'redis'
brew 'ripgrep'
brew 'ruby-install'
brew 'ruby-build'
brew 'rust'
brew 'rustup-init'
brew 'ssh-copy-id'
brew 'stack'
brew 'switchaudio-osx'
brew 'terminal-notifier'
brew 'the_silver_searcher'
brew 'tig'
brew 'tldr'
brew 'tmate'
brew 'tmux', args: ['--with-utf8proc']
brew 'tree'
brew 'unixodbc'
brew 'urlview'
brew 'watchman', args: ['--HEAD']
brew 'weechat', args: ['--with-ruby', '--with-python@2', '--with-perl', '--with-lua', '--with-aspell', '--with-curl', '--HEAD']
brew 'wget', args: ['enable-iri']
brew 'wxmac'
brew 'wifi-password'
brew 'yubico-piv-tool'
brew 'libyubikey'
brew 'pam_yubico'
brew 'yubikey-personalization'
brew 'wemux'
brew 'zsh', args: ['--with-unicode9', '--without-etcdir']
brew 'zsh-completions'
brew 'zsh-lovers'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

cask '1password'
cask '1password-cli'
cask 'alfred'
# cask 'android-platform-tools'
# cask 'bettertouchtool'
cask 'bartender'
cask 'brave-dev'
cask 'cloudapp'
cask 'dash'
cask 'font-firacode-nerd-font'
cask 'font-firacode-nerd-font-mono'
cask 'caldigit-thunderbolt-charging'
cask 'caldigit-usb-c-dock-driver '
cask 'contexts'
cask 'controlplane'
cask 'cumulus'
cask 'docker'
cask 'dropbox'
# install elgato thunderbolt 3 support app: https://www.elgato.com/dock/support
# cask 'elm-platform' # installed via asdf
cask 'encryptMe'
cask 'firefox'
cask 'firefox-developer-edition'
cask 'google-chrome-beta'
# cask 'google-hangouts'
cask 'graphiql'
cask 'hazel'
cask 'hammerspoon'
cask 'intel-power-gadget'
cask 'istat-menus'
cask 'iterm2-nightly'
cask 'java'
# cask 'caskroom/versions/java8'
cask 'karabiner-elements'
cask 'kitty'
cask 'libreoffice'
cask 'licecap'
cask 'ngrok'
# cask 'mysimbl'
# cask 'near-lock'
# cask 'oni'
# cask 'postgres'
cask 'postman'
cask 'shiori'
cask 'slack'
cask 'spotify'
# cask 'the-unarchiver'
cask 'usb-overdrive'
# cask 'ubersicht'
# cask 'virtualbox'
# cask 'vox'
# cask 'yubiswitch'
cask 'visual-studio-code'
# cask 'yubico-authenticator'
cask 'yakyak'

mas 'Fantastical2', id: 975937182
mas 'Spark', id: 1176895641
mas 'Tweetbot', id: 557168941
mas 'Xcode', id: 497799835
mas 'Bear', id: 1091189122

