#!/usr/bin/env zsh

cask_args appdir: "/Applications"

# -- taps --

# tap "caskroom/cask"
# tap "caskroom/fonts"
# tap "caskroom/versions" # enbala uses this one for java11 things :(

tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask-versions"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "neovim/neovim"
tap "caius/jo"
tap "simeji/jid"
tap "jeroenknoops/tap"
tap "browsh-org/homebrew-browsh"
tap "qmk/qmk"
tap "heroku/brew"

# NOTE/REF: https://github.blog/2020-07-02-git-credential-manager-core-building-a-universal-authentication-experience/#macos
tap "microsoft/git"



# -- for qmk_toolbox --

# brew tap osx-cross/avr; brew tap PX4/homebrew-px4; brew install avr-gcc@8; brew link --force avr-gcc@8; brew install dfu-programmer dfu-util gcc-arm-none-eabi avrdude qmk; brew cask install qmk-toolbox;
tap "osx-cross/avr"
tap "PX4/homebrew-px4"
tap "homebrew/cask-drivers"
# NOTE: at present, 20200327, qmk doesn't support >=avr-gcc@9
brew "avr-gcc@8", link: true
brew "dfu-programmer"
brew "dfu-util"
brew "gcc-arm-none-eabi"
brew "avrdude"
cask "qmk-toolbox"
brew "qmk"



# -- cli --

brew "abduco"
brew "ansifilter"
brew "autoconf"
brew "automake"
brew "aspell" #, args: ["with-lang-en"]
# brew "asdf"
brew "bandwhich"
brew "bat"
brew "browsh"
brew "ccls"
brew "cmake"
brew "coreutils"
brew "curl"
brew "dbus"
brew "diff-so-fancy"
brew "docker"
brew "docker-compose"
brew "docker-machine" #, restart_service: true, link: false
# brew "docker-completion"
# brew "doxygen", args: ["with-qt", "with-graphviz", "with-llvm"]
# brew "elixir" # installed via asdf
brew "exa"
brew "extract_url"
brew "exercism"
brew "fasd"
brew "fd"
brew "ffind"
brew "figlet"
brew "findutils"
brew "fontforge"
brew "fzf"
brew "fzy"
brew "gawk"
brew "gettext"
brew "gist"
brew "git"
brew "git-extras"
brew "gnutls"
brew "gnupg"
brew "gnu-sed" #, args: ["with-default-names"]
brew "gpg" # required for asdf-nodejs
brew "grc"
brew "grv"
brew "heroku"
brew "hub"
brew "highlight"
brew "httpie"
brew "htop"
brew "ical-buddy"
brew "jid"
brew "jo"
brew "jq"
brew 'lazydocker'
brew 'lazygit'
brew "libgcrypt"
brew "libtool"
brew "libyaml"
brew "libxslt"
brew "llvm"
brew "lnav"
# brew "lua" # installed via asdf
brew "lsd"
brew "luajit"
brew "luarocks"
brew "libarchive"
# brew "m-cli"
# brew "mac-cli"
brew "mas"
brew "moreutils"
brew "mysql"
brew "mycli"
# brew "mysql@5.6"
brew "ncurses"
brew "neovim", args: ["HEAD"]
brew "nmap"
brew "noti"
brew "openssl"
brew "openssl@1.1"
brew "p7zip"
brew "perl"
brew "pgcli"
brew "pick"
brew "pkg-config"
brew "postgresql"
# initdb /usr/local/var/postgres -E utf8
brew "python@3.7", link: false
brew "python@3.8", link: false
brew "python@3.9", link: true
brew "readline"
brew "reattach-to-user-namespace" #, args: ["wrap-pbcopy-and-pbpaste"]
brew "ren"
brew "redis"
brew "ripgrep"
# brew "rlue/utils/timer" -- broke?
brew "ruby-install"
brew "ruby-build"
brew "rust"
brew "rustup-init"
brew "ssh-copy-id"
brew "stack"
brew "switchaudio-osx"
brew "terminal-notifier"
brew "tidy-html5"
brew "tldr"
brew "tmux"
brew "tree"
brew "tree-sitter"
brew "unixodbc"
brew "urlview"
# brew "watchman", args: ["HEAD"]
brew "weechat", args: ["HEAD"]
brew "wget"
brew "wxmac"
brew "wifi-password"
brew "yubico-piv-tool"
brew "libyubikey"
brew "pam_yubico"
brew "yubikey-personalization"
brew "wemux"
brew "zsh"
brew "zsh-completions"
brew "zsh-lovers"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"


# -- cli --

# - fonts
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-ia-writer-quattro"

# - gui
cask "1password"
cask "1password-cli"
cask "alfred"
# cask "android-platform-tools"
cask "balenaetcher"
cask "bettertouchtool"
cask "bartender"
cask "brave-browser"
# cask "cloudapp"
cask "dash"
cask "caldigit-thunderbolt-charging"
cask "caldigit-docking-utility"
# cask "calibre"
cask "contexts"
cask "controlplane"
cask "docker"
cask "dropbox"
# cask "dropshare" # recommended by @thewatts on CiT
cask "discord"
cask "expressvpn"
cask "git-credential-manager-core"
cask "hazel"
cask "hammerspoon"
# cask "hiddenbar"
cask "intel-power-gadget"
cask "insomnia"
cask "istat-menus"
# cask "java"
# cask "caskroom/versions/java8"
cask "karabiner-elements"
cask "kitty"
# cask "licecap"
cask "loom"
cask "marked"
cask "ngrok"
# cask "mysimbl"
# cask "near-lock"
# cask "postgres"
# cask "postman"
# handled by hammerspoon now :point_down:
cask "slack"
cask "spotify"
# cask "teamviewer"
cask "thingsmacsandboxhelper"
cask "unshaky"
cask "vagrant"
cask "the-unarchiver"
# cask "usb-overdrive" # causes issues with QMK keyboards
# cask "ubersicht"
cask "virtualbox"
cask "yubico-authenticator"
cask "yubico-yubikey-manager"
cask "yubico-yubikey-piv-manager"


# -- app store (mas) --

mas "Fantastical", id: 975937182
mas "Spark", id: 1176895641
mas "Tweetbot", id: 557168941
mas "Xcode", id: 497799835
mas "Drafts", id: 1435957248
mas "Things", id: 904280696
# mas "Canary Mail", id: 1236045954
