fisherman/await
oh-my-fish/plugin-brew
oh-my-fish/plugin-chruby
fisherman/fnm
fisherman/fzf
fisherman/get
fisherman/get_file_age
fisherman/getopts
fisherman/grc
fisherman/last_job_id
fisherman/menu
oh-my-fish/plugin-node
oh-my-fish/plugin-osx
rafaelrinaldi/pure
oh-my-fish/plugin-ssh
oh-my-fish/plugin-tmux
fisherman/z


